app/controllers/categorys_controller.rb

  def index
    @user = User.find(params[:user_id])
    @categories = Category.where(user_id: @current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 5]]

  def show
    @user = User.find(params[:user_id])
    @categories = Category.where(user_id: @current_user.id)
    @category = @categories.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 5], ["LIMIT", 1]]

  def create
    @category = Category.create(category_params)
---
INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Work"], ["user_id", 5], ["created_at", "2020-05-12 16:20:30.390617"], ["updated_at", "2020-05-12 16:20:30.390617"]]

  def update
    @user = User.find(params[:user_id])
    @categories = Category.where(user_id: @current_user.id)
    @category = @categories.find(params[:id])

    if @category.update(category_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Class_update"], ["updated_at", "2020-05-12 16:53:21.085913"], ["id", 2]]

  def destroy
    @user = User.find(@current_user.id)
    @categories = Category.where(user_id: @current_user.id)
    @category = @categories.find(params[:id])
    @category.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 5], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 5]]

  def category_params
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]