app/controllers/jots_controller.rb

  def index
    @user = User.find(params[:user_id])
    @categories = Category.where(user_id: params[:user_id])
    @category = @categories.find(params[:category_id])
    @jots = Jot.where(category_id: @category.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 2], ["LIMIT", 1]]
SELECT "jots".* FROM "jots" WHERE "jots"."category_id" = $1  [["category_id", 2]]

  def show
    @user = User.find(params[:user_id])
    @categories = Category.where(user_id: @current_user.id)
    @category = @categories.find(params[:id])
    @jot = Jot.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 2], ["LIMIT", 1]]
SELECT "jots".* FROM "jots" WHERE "jots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @jot = Jot.create(jot_params)
---
INSERT INTO "jots" ("title", "note", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "First"], ["note", "Here is a note that I wrote"], ["category_id", 2], ["created_at", "2020-05-12 18:24:20.752351"], ["updated_at", "2020-05-12 18:24:20.752351"]]

  def destroy
    @jot = Jot.find(params[:id])
    @jot.destroy
---
SELECT "jots".* FROM "jots" WHERE "jots"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "jots" WHERE "jots"."id" = $1  [["id", 3]]

  def jot_params
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]