app/controllers/users_controller.rb

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "admin1@email.com"], ["password_digest", "$2a$12$sE1pl6DyhovJQOah4NiR5ebgKCzcXxH7OdZBlaBxL99LFZC4evMaS"], ["updated_at", "2020-05-12 15:52:47.202840"], ["id", 5]]
---
  def update
    if @user.update(user_params)